# Pandasの復習

練習問題は、[gotty21/basic_pandas-64-knocks](https://github.com/gotty21/basic_pandas-64-knocks)をから抜粋しました。

公式ドキュメントを参照しながら解いてください。

* [10 minutes to pandas](https://pandas.pydata.org/docs/user_guide/10min.html)
* [pandas documentation](https://pandas.pydata.org/docs/index.html)

## 事前準備

データフレームを初期化するための関数`initialize()`を作ります。作業前にこの2つのセルを実行しましょう。

`openpyxl`はExcelファイルの読み込みに必要です。必要に応じてインストールしてください。

In [1]:
%pip install openpyxl

Collecting openpyxlNote: you may need to restart the kernel to use updated packages.

  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5

In [2]:
import pandas as pd

def initialize(flag=0):
    if flag == 0:
        return pd.read_csv("./data/main.csv")
    if flag == 1:
        return pd.read_csv("./data/add.csv")
    if flag == 2:
        return pd.read_excel("./data/data.xlsx")
    else:
        print("Please specify numbers between 0 to 2.")
        return None

## データの読み込み・確認

### pandasインポート

【演習】pandasライブラリをpdという名前でインポートしてください。

In [3]:
# your code goes here
import pandas as pd

In [ ]:
# answer

import pandas as pd

### csvファイルの読み込み

`./data/main.csv`を読み込んでデータフレームを作成し、dfという変数に格納します。

In [7]:
# your code goes here
df = pd.read_csv("./data/main.csv")

In [ ]:
file = "./data/main.csv"
df = pd.read_csv(file)

【演習】

`./data/add.csv`を読み込んでデータフレームを作成し、addという変数に格納してください。

In [8]:
# your code goes here
add = pd.read_csv("./data/add.csv")

### DataFrameのサイズの確認

【演習】dfのサイズを確認してください。

In [9]:
# 次の一行でデータフレームdfを初期化します。演習を行う前に都度実行してください。

df = initialize(0)

In [10]:
# your code goes here
df.size

22000

### DataFrameのレコード数の確認

【演習】dfのレコード数を確認してください。

In [11]:
df = initialize(0)

In [14]:
# your code goes here
row, col = df.shape
row

2000

## ラベル

### DataFrameのカラム名の取得

【演習】dfのcolumn名をリスト形式で取得してください。

In [15]:
df = initialize(0)

In [20]:
# your code goes here
list(df.columns)

['SK_ID_CURR',
 'TARGET',
 'NAME_CONTRACT_TYPE',
 'CODE_GENDER',
 'FLAG_OWN_CAR',
 'FLAG_OWN_REALTY',
 'CNT_CHILDREN',
 'AMT_INCOME_TOTAL',
 'FLAG_MOBIL',
 'REGION_POPULATION_RELATIVE',
 'OWN_CAR_AGE']

### DataFrameのカラム名の一部を変更

【演習】dfのcolumn名CODE_GENDERをGENDERに変更してください。

In [21]:
df = initialize(0)

In [25]:
# your code goes here
list(df.rename(columns={"CODE_GENDER": "GENDER"}).columns)

['SK_ID_CURR',
 'TARGET',
 'NAME_CONTRACT_TYPE',
 'GENDER',
 'FLAG_OWN_CAR',
 'FLAG_OWN_REALTY',
 'CNT_CHILDREN',
 'AMT_INCOME_TOTAL',
 'FLAG_MOBIL',
 'REGION_POPULATION_RELATIVE',
 'OWN_CAR_AGE']

### DataFrameのカラム名をすべて変更

【演習】column名をno1～no11というstr型の名前に変更してください。「リスト内包表記」を使用すると簡単です。調べてみてください。

In [26]:
df = initialize(0)

In [30]:
# your code goes here
df.columns = [f"no{i}" for i in range(1, 12)]
list(df.columns)

['no1', 'no2', 'no3', 'no4', 'no5', 'no6', 'no7', 'no8', 'no9', 'no10', 'no11']

## 各列のデータの確認

###  任意の列のユニーク（一意）な要素を確認

In [31]:
df = initialize(0)

【演習】dfのCODE_GENDER列のユニークな要素を確認してください。

In [33]:
# your code goes here
df["CODE_GENDER"].unique().tolist()

['M', 'F']

### 各列のユニークな要素の数を確認

【演習】dfの各列のユニークな要素の数を出力してください。

In [34]:
df = initialize(0)

In [36]:
# your code goes here
df.nunique()

SK_ID_CURR                    2000
TARGET                           2
NAME_CONTRACT_TYPE               2
CODE_GENDER                      2
FLAG_OWN_CAR                     2
FLAG_OWN_REALTY                  2
CNT_CHILDREN                     5
AMT_INCOME_TOTAL               139
FLAG_MOBIL                       1
REGION_POPULATION_RELATIVE      78
OWN_CAR_AGE                     36
dtype: int64

### 任意の列のユニークな要素の数とその出現回数を確認

【演習】dfのCNT_CHILDREN列の要素とその出現回数を確認してください。

In [37]:
df = initialize(0)

In [39]:
# your code goes here
df["CNT_CHILDREN"].value_counts()

CNT_CHILDREN
0    1414
1     388
2     170
3      26
4       2
Name: count, dtype: int64

## データの取り出し

### 任意の１つの列の取り出し

【演習】dfのTARGETの列のみ表示してください。

In [40]:
df = initialize(0)

In [42]:
# your code goes here
df["TARGET"]

0       1
1       0
2       0
3       0
4       0
       ..
1995    1
1996    0
1997    0
1998    0
1999    0
Name: TARGET, Length: 2000, dtype: int64

【演習】dfの左から3番目の列のみ表示してください。

In [43]:
df = initialize(0)

In [47]:
# your code goes here
df.iloc[:, 2]

0            Cash loans
1            Cash loans
2       Revolving loans
3            Cash loans
4            Cash loans
             ...
1995         Cash loans
1996         Cash loans
1997    Revolving loans
1998    Revolving loans
1999         Cash loans
Name: NAME_CONTRACT_TYPE, Length: 2000, dtype: object

### 複数の列の取り出し

【演習】dfのTARGET列とCODE_GENDER列のみ表示してください。

In [48]:
df = initialize(0)

In [50]:
# your code goes here
df[["TARGET", "CODE_GENDER"]]

      TARGET CODE_GENDER
0          1           M
1          0           F
2          0           M
3          0           F
4          0           M
...      ...         ...
1995       1           F
1996       0           M
1997       0           F
1998       0           F
1999       0           M

[2000 rows x 2 columns]

【演習】dfのTARGET列とCODE_GENDER列までの列を表示してください。

In [51]:
df = initialize(0)

In [53]:
# your code goes here
df.loc[:, "TARGET": "CODE_GENDER"]

      TARGET NAME_CONTRACT_TYPE CODE_GENDER
0          1         Cash loans           M
1          0         Cash loans           F
2          0    Revolving loans           M
3          0         Cash loans           F
4          0         Cash loans           M
...      ...                ...         ...
1995       1         Cash loans           F
1996       0         Cash loans           M
1997       0    Revolving loans           F
1998       0    Revolving loans           F
1999       0         Cash loans           M

[2000 rows x 3 columns]

### 条件検索

【演習】CODE_GENDER列が'F'かつAMT_INCOME_TOTAL列が500000以上のデータポイントを表示してください。

In [54]:
df = initialize(0)

In [60]:
# your code goes here
df[(df["CODE_GENDER"] == "F") & (df["AMT_INCOME_TOTAL"] >= 500000)]

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,FLAG_MOBIL,REGION_POPULATION_RELATIVE,OWN_CAR_AGE
332,100380,0,Cash loans,F,N,Y,0,630000.0,1,0.072508,NaN
930,101073,1,Cash loans,F,Y,N,0,540000.0,1,0.008474,18.0
1064,101235,0,Revolving loans,F,N,Y,0,720000.0,1,0.010147,NaN
1568,101839,0,Cash loans,F,N,N,0,630000.0,1,0.020713,NaN
1586,101857,0,Cash loans,F,N,Y,0,720000.0,1,0.046220,NaN
1644,101929,1,Revolving loans,F,Y,Y,0,697500.0,1,0.046220,7.0
1723,102015,0,Cash loans,F,N,Y,0,1935000.0,1,0.007114,NaN
1793,102097,0,Revolving loans,F,Y,Y,1,540000.0,1,0.032561,16.0

## ソート

### 任意の一列で昇順ソート

【演習】dfのAMT_INCOME_TOTALの列で昇順ソートして表示してください。

In [61]:
df = initialize(0)

In [62]:
# your code goes here
df.sort_values("AMT_INCOME_TOTAL")

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,FLAG_MOBIL,REGION_POPULATION_RELATIVE,OWN_CAR_AGE
1678,101965,0,Cash loans,F,N,N,0,25650.0,1,0.018850,NaN
495,100572,0,Cash loans,F,N,Y,0,31500.0,1,0.031329,NaN
283,100326,1,Cash loans,M,Y,Y,0,36000.0,1,0.018209,27.0
1221,101442,0,Cash loans,F,N,N,0,36000.0,1,0.018850,NaN
651,100743,0,Cash loans,F,N,Y,0,38250.0,1,0.018850,NaN
...,...,...,...,...,...,...,...,...,...,...,...
1064,101235,0,Revolving loans,F,N,Y,0,720000.0,1,0.010147,NaN
319,100366,0,Revolving loans,M,Y,Y,0,765000.0,1,0.002506,3.0
1238,101461,0,Cash loans,M,Y,Y,0,810000.0,1,0.072508,5.0
1504,101769,0,Revolving loans,M,Y,Y,0,1080000.0,1,0.072508,7.0
1723,102015,0,Cash loans,F,N,Y,0,1935000.0,1,0.007114,NaN

### 任意の一列で降順ソート

【演習】dfのAMT_INCOME_TOTALの列で降順ソート表示してください。

In [63]:
df = initialize(0)

In [64]:
# your code goes here
df.sort_values("AMT_INCOME_TOTAL", ascending=False)

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,FLAG_MOBIL,REGION_POPULATION_RELATIVE,OWN_CAR_AGE
1723,102015,0,Cash loans,F,N,Y,0,1935000.0,1,0.007114,NaN
1504,101769,0,Revolving loans,M,Y,Y,0,1080000.0,1,0.072508,7.0
1238,101461,0,Cash loans,M,Y,Y,0,810000.0,1,0.072508,5.0
319,100366,0,Revolving loans,M,Y,Y,0,765000.0,1,0.002506,3.0
1586,101857,0,Cash loans,F,N,Y,0,720000.0,1,0.046220,NaN
...,...,...,...,...,...,...,...,...,...,...,...
651,100743,0,Cash loans,F,N,Y,0,38250.0,1,0.018850,NaN
1221,101442,0,Cash loans,F,N,N,0,36000.0,1,0.018850,NaN
283,100326,1,Cash loans,M,Y,Y,0,36000.0,1,0.018209,27.0
495,100572,0,Cash loans,F,N,Y,0,31500.0,1,0.031329,NaN
1678,101965,0,Cash loans,F,N,N,0,25650.0,1,0.018850,NaN

## 統計量

### 基本統計量

【演習】dfのAMT_INCOME_TOTAL列の平均、中央値、合計、最大値、最小値、最頻値をそれぞれ出力してください。

In [65]:
df = initialize(0)

In [81]:
# your code goes here
desc = df["AMT_INCOME_TOTAL"].describe()
sum = df["AMT_INCOME_TOTAL"].sum()
mode = df["AMT_INCOME_TOTAL"].mode()[0]
print(desc["mean"])
print(desc["50%"])
print(sum)
print(desc["max"])
print(desc["min"])
print(mode)

170118.76182749998
144000.0
340237523.655
1935000.0
25650.0
112500.0

### 要約統計量

【演習】dfのAMT_INCOME_TOTAL列の要約統計量を出力してください。

In [82]:
df = initialize(0)

In [83]:
# your code goes here
df["AMT_INCOME_TOTAL"].describe()

count    2.000000e+03
mean     1.701188e+05
std      1.017594e+05
min      2.565000e+04
25%      1.125000e+05
50%      1.440000e+05
75%      2.025000e+05
max      1.935000e+06
Name: AMT_INCOME_TOTAL, dtype: float64

### groupby

【演習】dfのCODE_GENDERで集約し、それぞれのAMT_INCOME_TOTALの最大値を出力してください。

In [84]:
df = initialize(0)

In [93]:
# your code goes here
df.groupby("CODE_GENDER")["AMT_INCOME_TOTAL"].max()

CODE_GENDER
F    1935000.0
M    1080000.0
Name: AMT_INCOME_TOTAL, dtype: float64

【演習】dfのCODE_GENDERごとにNAME_CONTRACT_TYPEで集約し、各グループ内の平均と分散を出力してください。また、出力を見やすくするためにindexをリセットしてください。

In [99]:
df = initialize(0)

In [105]:
# your code goes here
df.groupby(["CODE_GENDER", "NAME_CONTRACT_TYPE"])["AMT_INCOME_TOTAL"].agg(['mean', 'var']).reset_index()

  CODE_GENDER NAME_CONTRACT_TYPE           mean           var
0           F         Cash loans  156289.567886  9.266765e+09
1           F    Revolving loans  158903.500000  1.214862e+10
2           M         Cash loans  189622.313091  8.419663e+09
3           M    Revolving loans  240020.270270  3.032855e+10

## ファイル出力

### csvファイルに出力

【演習】dfを、行番号、列番号なしで、`./data`ディレクトリ内に`output.csv`という名前で出力してください。

In [106]:
df = initialize(0)

In [111]:
# your code goes here
df.to_csv("./data/output.csv", header=False, index=False)

---

この演習は以上です。